[
  {
    "title": "RBI hikes interest rates by 25 basis points to combat inflation.",
    "content": "The Reserve Bank of India announced today a 25 basis point increase in the key repo rate, bringing it to 6.5%. This move is part of an ongoing effort to curb persistent inflationary pressures, a decision widely anticipated by financial markets.",
    "source_url": "http://manualsource.com/rbi1"
  },
  {
    "title": "Indian Central Bank raises repo rate by 0.25% in expected move.",
    "content": "In a widely anticipated monetary policy action, the RBI has increased its primary lending rate by 0.25 percentage points. Governor Shaktikanta Das stated the focus remains on withdrawing accommodation.",
    "source_url": "http://manualsource.com/rbi2"
  },
  {
    "title": "Gold price today: Comex gold rate hits six-week high of $4,299/oz amid rising US Fed rate cut bets",
    "content": "Gold price today: Comex gold futures in New York were trading 0.10% higher at $4,259.10/ounce as of 5:13 p.m. (GMT) on 1 December 2025. The rates hit a six-week high of $4,299/oz during Monday's global commodity market session.&amp;nbsp;",
    "source_url": "https://www.livemint.com/market/commodities/gold-price-today-comex-gold-rate-hits-six-week-high-of-4-299-oz-amid-rising-us-fed-rate-cut-bets-11764608376511.html"
  },
  {
    "title": "Sebi paves the way for ICICI Pru AMC's IPO",
    "content": "The IPO by ICICI Prudential Asset Management, approved by Sebi, is anticipated to generate around  ₹10,000 crore through an offer for sale. It reflects a growing trend in asset management as firms seek to attract more retail and institutional investors.",
    "source_url": "https://www.livemint.com/market/stock-market-news/sebi-paves-the-way-for-icici-pru-amcs-ipo-investors-market-nippon-offer-for-sale-cash-flows-11764603751772.html"
  },
  {
    "title": "Sebi to revamp master circular for stock exchanges in the coming months, says chief Tuhin Kanta Pandey",
    "content": "Sebi proposed simplifying the regulatory framework for stock exchanges and clearing corporations to enhance the ease of doing business in an October consultation paper.",
    "source_url": "https://www.livemint.com/market/stock-market-news/sebi-revamp-master-circular-stock-exchanges-india-ease-business-investors-11764599094948.html"
  },
  {
    "title": "US Stock Market Today: Wall Street slips ahead of Jerome Powell speech",
    "content": "As of 11:30 a.m. Eastern Time, the S&amp;amp;P 500 fell 0.3%, the Dow Jones Industrial Average was down 0.4%, and the Nasdaq Composite was 0.4% lower.",
    "source_url": "https://www.livemint.com/market/stock-market-news/us-stock-market-today-wall-street-slips-ahead-of-jerome-powell-speech-11764599959108.html"
  },
  {
    "title": "Bharat Dynamics share price to be in focus on Tuesday as company secures  ₹2,462 crore order for missiles",
    "content": "Bharat Dynamics is expected to attract investor interest after securing a  ₹2,462 crore order from the Indian Army for missiles. Earlier in mid-November, the company had signed a contract worth  ₹2,096 crore with the Ministry of Defence for the supply of Invar anti-tank missiles.",
    "source_url": "https://www.livemint.com/market/stock-market-news/bharat-dynamics-share-price-to-be-in-focus-on-tuesday-as-company-secures-rs-2-462-crore-order-for-missiles-11764597455997.html"
  },
  {
    "title": "Government to divest up to 6% stake in Bank of Maharashtra, aims to garner  ₹2,600 crore",
    "content": "The government will divest up to a 6% stake in Bank of Maharashtra to comply with public shareholding regulations. At the end of the September quarter, the government held a 79.6% stake in the bank, valued at  ₹35,29,543 crore.",
    "source_url": "https://www.livemint.com/market/stock-market-news/government-to-divest-up-to-6-stake-in-bank-of-maharashtra-aims-to-garner-rs-2-600-crore-11764598316107.html"
  },
  {
    "title": "SME IPO Astron Multigrain subscribed 0.74x on Day 1; retail portion fully booked, GMP signals 19% listing pop",
    "content": "Astron Multigrain's IPO, which opened on December 01, has received strong investor interest, with a subscription of 0.74 times by Day 02. The price band is set at  ₹63 per share, and the retail portion was subscribed 1.10 times.",
    "source_url": "https://www.livemint.com/market/sme-ipo-astron-multigrain-subscribed-0-74x-on-day-1-retail-portion-fully-booked-gmp-signals-19-listing-pop-11764595631738.html"
  },
  {
    "title": "RBI policy outcome this week: Which debt funds should bond investors consider as 25 bps rate cut on cards?",
    "content": "In a period of uncertainty around upcoming RBI rate decisions, investors are generally better off maintaining their existing bond allocations rather than reacting to short-term market swings, note experts.",
    "source_url": "https://www.livemint.com/market/bonds/rbi-policy-outcome-this-week-which-debt-funds-should-bond-investors-consider-as-25-bps-rate-cut-on-cards-11764595417320.html"
  },
  {
    "title": "Airbus shares slump nearly 9% after report flagged latest quality issues in A320 aircraft — details here",
    "content": "Airbus shares fell nearly 9% on December 1 due to a report alleging quality issues with fuselage panels in A320-family aircraft.&amp;nbsp;",
    "source_url": "https://www.livemint.com/market/stock-market-news/airbus-shares-slump-nearly-9-after-report-flagged-latest-quality-issues-in-a320-aircraft-details-here-11764592765521.html"
  },
  {
    "title": "Nifty 50’s 3-month rally lifts nearly half its stocks 20–50% in 2025; Bajaj Finance leads gains",
    "content": "Among the top performers in the Nifty 50 in 2025 are stocks from the auto and NBFC space, with Bajaj Finance leading the pack as it has surged 50% so far, while Bajaj Finserv has also risen sharply by 32.3%. Maruti Suzuki has surged 48.24% to  ₹16,097, marking its largest yearly gain since 2017.&amp;nbsp;",
    "source_url": "https://www.livemint.com/market/stock-market-news/nifty-50-s-3-month-rally-lifts-nearly-half-its-stocks-20-50-in-2025-bajaj-finance-leads-gains-11764579258757.html"
  },
  {
    "title": "Meesho IPO opens soon: GMP, price, date, review, other details you may like to know",
    "content": "Meesho IPO opens soon: E-commerce company, Meesho, is set to open its initial public offering for primary market investors starting from 3 December 2025, as the company aims to raise funds from the stock market. Take a look at 10 things you need to know before investing in the public issue.&amp;nbsp;",
    "source_url": "https://www.livemint.com/market/ipo/meesho-ipo-opens-soon-gmp-price-date-review-other-details-you-may-like-to-know-11764585899362.html"
  },
  {
    "title": "Elon Musk says he doesn't buy stocks, explains why Google, Nvidia will be valuable in future on Nikhil Kamath's podcast",
    "content": "Musk, who is the brains behind Tesla and SpaceX, and also the owner of social media platform X, answered his philosophy when it comes to investing in companies for the long term.",
    "source_url": "https://www.livemint.com/market/stock-market-news/elon-musk-says-he-doesnt-buy-stocks-explains-why-google-nvidia-will-be-valuable-in-future-on-nikhil-kamaths-podcast-11764591080180.html"
  },
  {
    "title": "From policy to markets: A look at Sanae Takaichi's economic gameplan",
    "content": "The Japanese REER is back to levels last seen in the early 1970’s. As such, we conclude that the yen is attractively valued and expect moderate appreciation over 2026, supported by very gradual interest rate hikes by the Bank of Japan.",
    "source_url": "https://www.livemint.com/market/stock-market-news/from-policy-to-markets-a-look-at-sanae-takaichis-economic-gameplan-11764588422083.html"
  },
  {
    "title": "Is Santa rally on cards for Nifty 50? What 10-year trend and experts signal for Indian stock market in December",
    "content": "Nifty 50 closed slightly lower after reaching a new high, with analysts forecasting a 1%-5% increase by December's end. However, midcaps and small caps may experience continued weakness due to liquidity issues.",
    "source_url": "https://www.livemint.com/market/stock-market-news/is-santa-rally-on-cards-for-nifty-50-what-10-year-trend-and-experts-signal-for-indian-stock-market-in-december-11764586698254.html"
  },
  {
    "title": "Warren Buffett’s “patience advantage” goes viral again as Shay Boloor breaks it down on X",
    "content": "Shay Boloor reiterates Buffett's wisdom that patience is crucial for investors. In a climate of rampant FOMO and emotional trading, he reminds investors that avoiding impulsive moves is beneficial, as the market punishes bad decisions, reinforcing the importance of strategic waiting.",
    "source_url": "https://www.livemint.com/market/stock-market-news/warren-buffett-s-patience-advantage-goes-viral-again-as-shay-boloor-breaks-it-down-on-x-11764586352452.html"
  },
  {
    "title": "Wall Street gets its groove back for December. Not everybody is feelin’ it.",
    "content": "The S&amp;P 500 had an amazing turnaround in the past week, coming back from one of its worst Novembers. But can it keep the party going?",
    "source_url": "https://www.livemint.com/market/stock-market-news/wall-street-gets-its-groove-back-for-december-not-everybody-is-feelin-it-11764584091205.html"
  },
  {
    "title": "Nifty IT plunges 13% YTD: Can India-US trade deal, Fed rate cut lift index in 2026?",
    "content": "The Nifty 50 index has reached a new all-time high, while the Nifty IT index lags, down over 20% from its peak. Factors like US tariffs and sluggish growth are impacting Indian IT stocks, leading to valuation compression and a cautious outlook for the sector.",
    "source_url": "https://www.livemint.com/market/stock-market-news/nifty-it-plunges-13-ytd-can-india-us-trade-deal-fed-rate-cut-lift-index-in-2026-11764580140740.html"
  },
  {
    "title": "Rupee hits all-time low, holds above 90/USD mark with central bank help",
    "content": "INDIA-MARKETS/RUPEE (UPDATE 1):INDIA RUPEE-Rupee hits all-time low, holds above 90/USD mark with central bank help",
    "source_url": "https://www.livemint.com/market/stock-market-news/rupee-hits-all-time-low-holds-above-90-usd-mark-with-central-bank-help-11764583906943.html"
  },
  {
    "title": "Top Gainers &amp; Losers on Dec 01: Wockhardt, JM Financial, TVS Motor, Hindustan Copper, Paytm among top gainers",
    "content": "Indian stocks declined on December 01 after reaching highs, influenced by a record low rupee against the dollar and foreign investor selling. The Nifty 50 fell 150 points, closing at 26,175, while the Sensex dropped 531 points to 85,625.",
    "source_url": "https://www.livemint.com/market/stock-market-news/top-gainers-losers-on-dec-01-wockhardt-jm-financial-tvs-motor-hindustan-copper-paytm-swiggy-among-top-gainer-11764582657878.html"
  },
  {
    "title": "Sensex slips 65 points, Nifty 50 ends below 26,200— 10 key highlights from Indian stock market today",
    "content": "The Sensex ended 65 points, or 0.08%, down 85,641.90, while the Nifty 50 closed the day at 26,175.75, down 27 points, or 0.10%. The BSE Midcap index fell 0.19% but the Smallcap index rose by 0.05%.",
    "source_url": "https://www.livemint.com/market/stock-market-news/sensex-slips-65-points-nifty-50-ends-below-26-200-10-key-highlights-from-indian-stock-market-today-11764583113603.html"
  },
  {
    "title": "PMI: Indian manufacturers' business confidence shrinks as US tariffs start to pinch",
    "content": "The seasonally adjusted HSBC India Manufacturing Purchasing Managers’ Index slid to 56.6 in November from 59.2 in October, marking the slowest improvement in operating conditions since February.",
    "source_url": "https://www.livemint.com/market/mark-to-market/india-manufacturing-slowdown-us-trade-tariffs-impact-pmi-11764579747692.html"
  },
  {
    "title": "Mother Nutri Foods IPO allotment date likely today. GMP, steps to check share allotment status online for SME IPO",
    "content": "Mother Nutri Foods IPO allotment date is likely today, December 1, and the IPO listing date is December 3. Investors can check Mother Nutri Foods IPO allotment status online through the websites of BSE and the IPO registrar. Bigshare Services is the Mother Nutri Foods IPO registrar.",
    "source_url": "https://www.livemint.com/market/ipo/mother-nutri-foods-ipo-allotment-date-likely-today-gmp-steps-to-check-share-allotment-status-online-for-sme-ipo-11764581172319.html"
  },
  {
    "title": "Expert view: Indian investors should continue building exposure to US equities, says Appreciate CEO",
    "content": "Expert view: With strong external positions and a focus on high-quality businesses, Subho Moulik, Founder and CEO of Appreciate, suggests leveraging market fluctuations to build a robust global portfolio, emphasising long-term growth over short-term volatility.",
    "source_url": "https://www.livemint.com/market/stock-market-news/expert-view-indian-investors-should-continue-building-exposure-to-us-equities-says-appreciate-ceo-11764579208329.html"
  },
  {
    "title": "Invicta Diagnostic IPO opens: Issue booked 9% so far on Day 1 — Check GMP, price band and other details",
    "content": "Invicta Diagnostics IPO opened on December 1 and will close on December 3, looking to raise  ₹28 crore. The company plans to use funds for new diagnostic centres in Maharashtra.&amp;nbsp;",
    "source_url": "https://www.livemint.com/market/ipo/invicta-diagnostic-ipo-check-price-band-gmp-subscription-status-and-other-details-about-sme-ipo-11764580412516.html"
  },
  {
    "title": "Nithin Kamath recalls how a Bengaluru airport conversation led to 10 years of zero brokerage at Zerodha",
    "content": "Nithin Kamath recounted how the decision was taken in November 2015 during a conversation with co-founder and CTO Kailash Nadh at Bengaluru airport, on their way to Kochi. The brokerage had just launched its trading platform Kite and was looking to shed its image of being only for active traders.",
    "source_url": "https://www.livemint.com/market/stock-market-news/nithin-kamath-recalls-how-a-bengaluru-airport-conversation-led-to-10-years-of-zero-brokerage-at-zerodha-11764578676209.html"
  },
  {
    "title": "Vinay Rajani of HDFC Securities suggests these stocks to buy for short-term",
    "content": "The domestic stock market opened strong with Nifty 50 at a record high of 26,325.80, driven by positive GDP data. However, indices traded flat later in the day, with potential for a 25 basis points rate cut from RBI amidst bullish trends in Nifty 50 and Bank Nifty.",
    "source_url": "https://www.livemint.com/market/stock-market-news/vinay-rajani-of-hdfc-securities-suggests-these-stocks-to-buy-for-shortterm-11764575913098.html"
  },
  {
    "title": "Market outlook: Dalal Street is gearing up for an upswing in 2026 — Here's why",
    "content": "Earnings upgrades are anticipated from Q3 onwards, driven by tax reforms, favourable monsoon conditions, moderated inflation, and accommodative monetary policy. This optimism extends into 2026, as global and domestic risks are expected to moderate.",
    "source_url": "https://www.livemint.com/market/stock-market-news/market-outlook-dalal-street-is-gearing-up-for-an-upswing-in-2026-heres-why-11764577427291.html"
  },
  {
    "title": "Wockhardt share price jumps over 19% after US FDA accepts new drug application for Zaynich",
    "content": "Wockhardt's shares jumped 19.3% to  ₹1,473 following the US FDA's acceptance of its antibiotic drug Zaynich's New Drug Application. The pharma shares have remained under pressure since hitting a one-year high in July 2025 and have so far lost 22% of their value.",
    "source_url": "https://www.livemint.com/market/stock-market-news/wockhardt-share-price-jumps-over-19-after-us-fda-accepts-new-drug-application-for-zaynich-11764576385270.html"
  },
  {
    "title": "Ravelcare IPO Day 1: Check GMP, subscription status, key dates, and other details - What to know before subscribing",
    "content": "Ravelcare's IPO opened for subscription on December 1, raising  ₹24.10 crore. The price band is  ₹123-130 per share. The IPO was subscribed 6x on Day 1, with strong investor interest indicated by a grey market premium of  ₹52.",
    "source_url": "https://www.livemint.com/market/ipo/ravelcare-ipo-day-1-check-gmp-subscription-status-key-dates-and-other-details-what-to-know-before-subscribing-11764576490711.html"
  },
  {
    "title": "Why do 30% term life insurance applications get rejected in India? Explained",
    "content": "While many people usually fear the rejection of their insurance claims, this analysis shows that many people cannot even get the term policy in the first place — as almost one in three applications are rejected during underwriting, which is the insurer’s evaluation stage.",
    "source_url": "https://www.livemint.com/market/stock-market-news/why-do-30-term-life-insurance-applications-get-rejected-in-india-explained-11764576153500.html"
  },
  {
    "title": "Emerging Stocks, Currencies Edge Higher as Traders Await US Data",
    "content": "Emerging-market stocks edged up Monday, with currencies steady as bets on a December rate cut by the Federal Reserve held firm.",
    "source_url": "https://www.livemint.com/market/stock-market-news/emerging-stocks-currencies-edge-higher-as-traders-await-us-data-11764576359619.html"
  },
  {
    "title": "Silver prices zoom 85% YTD to record high above  ₹1.78 lakh, outshine gold price. Will the rally extend to 2026?",
    "content": "MCX gold price has delivered returns of 60% so far in 2025, while MCX silver price has significantly outperformed, rallying 85% on a YTD basis. Over the past three months alone, gold prices have gained 25%, compared with a more than 40% spike in silver rates.",
    "source_url": "https://www.livemint.com/market/commodities/silver-prices-zoom-91-ytd-to-record-high-above-rs-1-78-lakh-outshine-gold-price-will-the-rally-last-in-2026-11764575274563.html"
  },
  {
    "title": "SBI expects RBI to hold rates in December, turns bullish on Nifty 500 stocks",
    "content": "State Bank of India expects the Reserve Bank of India to hold interest rates steady in light of robust Q2 GDP growth and low inflation. SBI finds concentration risk on the rise in the S&amp;amp;P 500, but the Nifty 500 looks better represented due to the representation of diverse sectors.",
    "source_url": "https://www.livemint.com/market/stock-market-news/sbi-expects-rbi-to-hold-rates-turns-bullish-on-nifty-500-stocks-11764574051615.html"
  },
  {
    "title": "Why smallcap index fell almost 3% in November despite Nifty hitting record highs; should you still buy?",
    "content": "November's Indian stock market saw large-caps rise while small-caps fell, driven by high valuations and lackluster earnings. Continued FII selling affected small-caps, but experts believe the correction may create opportunities for long-term investors looking to enter the market.",
    "source_url": "https://www.livemint.com/market/stock-market-news/why-nifty-small-cap-index-fell-almost-3-in-november-despite-nifty-50-hitting-record-highs-explained-11764575515946.html"
  },
  {
    "title": "Speb Adhesives IPO sees tepid demand on Day 1, issue subscribed 6% so far. Check GMP, key details, more",
    "content": "Speb Adhesives IPO opened on December 1, targeting  ₹52 to  ₹56 per share. It offers a minimum bid of 4,000 shares for retail investors. Proceeds will fund a new plant in Raigad, enhancing water-based adhesive production capacity.",
    "source_url": "https://www.livemint.com/market/ipo/speb-adhesives-ipo-sees-tepid-demand-on-day-1-issue-subscribed-6-so-far-check-gmp-key-details-speb-adhesives-ipo-gmp-11764569951239.html"
  }
]